names = {
    #room1
66004 : "กวีวัธน์ ศานติวรพงษ์",
66005: "ก้องธฤต เตชัสอนันต์ ",
66014 : "เขมจิรา จิราวัฒนอนันต์",
66017 : "จิรพัทธ์ โลหะวัฒนะกุล",
66022 : "ชญาณ์นันท์ รชตะวิวรรธน์",
66024 :"ชนัตถ์ ทีรฆวงศ์",
66030 : "ชัญญ์วรชา ชาญนำสิน",
66031 :'ชัญญา ลิ้มทองกุล',
66046 :'ณพล เหมพรรณไพเราะ',
66052 :'ณัชชา วาสนาประดิษฐ์',
66068 :'ดิน กวินอนันต์',
66086 : 'ธารธรรม เรืองวุฒิสกุลชัย',
66088 : 'ธีดา ปัทมสันติวงศ์',
66102 : 'ปพน ประสมศักดิ์',
66106 : 'ปราณรัก บ่ายคล้อย',
66112 : 'ปัญญากัญญ์ ไตรทางกูร',
66116 : 'ปัณณ์วิชญ์ สุทธิประภา',
66117 : 'ปาณิสรา สงวนพงษ์',
66118 : 'ปาณิสรา นิ่มมาโนช',
66131 : 'พนิตมน เอกโยคะ',
66135 : 'พริชฐ์ ธนสารวิมล',
66139 : 'พัทธ์ธีรา อรพิมพันธ์',
66163 :'ภาริธ น้อยคง',
66166 : 'ภีมอินทัช ธีระฐิติ',
66167 : 'ภูมิทรรศชล ทองศรี',
66177 : 'รรรชนก ศรีโสฬส',
66179 : 'ระริน หาญวนานนท์',
66183 : 'วชภณ อึ๊งล่ำซำ',
66184 : 'วชิรวินทร์ อัศวรุ่งโรจน์',
66194 : 'วิภู ธงชัยกุลฤทธิ์',
66197 :'ศรัณยพงศ์ ภิยโยภาพ',
66206 : 'ศุภิสรา ทองตันหยง',
66208 : 'สรกฤช ธัญญวรรณ์',
}
room_num = {
    1.1: "กวีวัธน์ ศานติวรพงษ์ (1)",
    2.1: "ก้องธฤต เตชัสอนันต์ ",
    3.1 : "เขมจิรา จิราวัฒนอนันต์",
    4.1: "จิรพัทธ์ โลหะวัฒนะกุล",
    5.1 : "ชญาณ์นันท์ รชตะวิวรรธน์",
    6.1 :"ชนัตถ์ ทีรฆวงศ์",
    7.1 : "ชัญญ์วรชา ชาญนำสิน",
    8.1 :'ชัญญา ลิ้มทองกุล',
    9.1 :'ณพล เหมพรรณไพเราะ',
    10.1 :'ณัชชา วาสนาประดิษฐ์',
    11.1 :'ดิน กวินอนันต์',
    12.1 : 'ธารธรรม เรืองวุฒิสกุลชัย',
    13.1 : 'ธีดา ปัทมสันติวงศ์',
    14.1 : 'ปพน ประสมศักดิ์',
    15.1 : 'ปราณรัก บ่ายคล้อย',
    16.1 : 'ปัญญากัญญ์ ไตรทางกูร',
    17.1 : 'ปัณณ์วิชญ์ สุทธิประภา',
    18.1 : 'ปาณิสรา สงวนพงษ์',
    19.1 : 'ปาณิสรา นิ่มมาโนช',
    20.1 : 'พนิตมน เอกโยคะ',
    21.1 : 'พริชฐ์ ธนสารวิมล',
    22.1 : 'พัทธ์ธีรา อรพิมพันธ์',
    23.1 :'ภาริธ น้อยคง',
    24.1 : 'ภีมอินทัช ธีระฐิติ',
    25.1 : 'ภูมิทรรศชล ทองศรี',
    26.1 : 'รรรชนก ศรีโสฬส',
    27.1 : 'ระริน หาญวนานนท์',
    28.1 : 'วชภณ อึ๊งล่ำซำ',
    29.1 : 'วชิรวินทร์ อัศวรุ่งโรจน์',
    30.1 : 'วิภู ธงชัยกุลฤทธิ์',
    31.1 :'ศรัณยพงศ์ ภิยโยภาพ',
    32.1 : 'ศุภิสรา ทองตันหยง',
    33.1: 'สรกฤช ธัญญวรรณ์',

}
while True:
    switched_dict = {y: x for x, y in room_num.items()}
    print("ระบบค้นหาชื่อจากรหัสประจำตัวนักเรียน")

    while True:
        try:
            readable_num = int(input("รหัสประจำตัวนักเรียน : "))
            break

        except ValueError:
            print("System : ใส่รหัสคับ")
            False



    if readable_num in names:
            print(names[readable_num])
    else:
            print("System : ไม่พบข้อมูล ขอโทดคับ")
    print("----------------")
    print("ระบบค้นหาห้องและเลขที่ จากชื่อ")


    while True:
        try:
            searchnum = str(input("ชื่อ : "))
            break

        except ValueError:
            print("System : ใส่ชื่อคับ")
            False
    if searchnum in switched_dict:

        if  ".1" in str(switched_dict[searchnum]):
            print(searchnum + "อยู่ห้อง 2/1 "+ "เลขที่ "+str(switched_dict[searchnum])[:-2])


    else:
        print("System : ไม่พบข้อมูล ขอโทดคับ")
    answer = input("R u done? ")
    if answer:
        break