names = {
    #room1
66004 : "กวีวัธน์ ศานติวรพงษ์",
66005: "ก้องธฤต เตชัสอนันต์ ",
66014 : "เขมจิรา จิราวัฒนอนันต์",
66017 : "จิรพัทธ์ โลหะวัฒนะกุล",
66022 : "ชญาณ์นันท์ รชตะวิวรรธน์",
66024 :"ชนัตถ์ ทีรฆวงศ์",
66030 : "ชัญญ์วรชา ชาญนำสิน",
66031 :'ชัญญา ลิ้มทองกุล',
66046 :'ณพล เหมพรรณไพเราะ',
66052 :'ณัชชา วาสนาประดิษฐ์',
66068 :'ดิน กวินอนันต์',
66086 : 'ธารธรรม เรืองวุฒิสกุลชัย',
66088 : 'ธีดา ปัทมสันติวงศ์',
66102 : 'ปพน ประสมศักดิ์',
66106 : 'ปราณรัก บ่ายคล้อย',
66112 : 'ปัญญากัญญ์ ไตรทางกูร',
66116 : 'ปัณณ์วิชญ์ สุทธิประภา',
66117 : 'ปาณิสรา สงวนพงษ์',
66118 : 'ปาณิสรา นิ่มมาโนช',
66131 : 'พนิตมน เอกโยคะ',
66135 : 'พริชฐ์ ธนสารวิมล',
66139 : 'พัทธ์ธีรา อรพิมพันธ์',
66163 :'ภาริธ น้อยคง',
66166 : 'ภีมอินทัช ธีระฐิติ',
66167 : 'ภูมิทรรศชล ทองศรี',
66177 : 'รรรชนก ศรีโสฬส',
66179 : 'ระริน หาญวนานนท์',
66183 : 'วชภณ อึ๊งล่ำซำ',
66184 : 'วชิรวินทร์ อัศวรุ่งโรจน์',
66194 : 'วิภู ธงชัยกุลฤทธิ์',
66197 :'ศรัณยพงศ์ ภิยโยภาพ',
66206 : 'ศุภิสรา ทองตันหยง',
66208 : 'สรกฤช ธัญญวรรณ์',
    #room2
66006 :'กันณพงศ์ สมพรเกียรติ',
66010 :'กิตติคุณ วงศ์สว่าง',

66012 : "เกศมณี ตันทวานิช",
66029 : "ชวินธร ชลศักดิ์ตระกูล",
66035: "ชุติกาญจน์ ศักดิ์สุวรรณ",
66069: "เติมบุญ ประกิตชัยวัฒนา",
66232 :"ทัชญา สุวรรณรัตน์",
66071: "ทิพย์พิมล ตรีพาสัย",
66084: "ธัญ มิ่งแก้ว",
66096: "นันท์ณรัตน์ ลีลาวรพันธุ์",
66099: "บวรทัต ต่อสุทธิ์กนก",
66110: "ปวริศา คงมะลวน",
66120: "ปารณีย์ มหาสุวีระชัย",
66123: "ปิติภัทรา ศิลโกเศศศักดิ์",
66126: "ปุณณพัฒน์ ศิลาทอง",
66129: "ผลัฏฐา ธีรฉัตรวัฒน์",
66148: "พิภู บูรณศิลป์",
66150: "พีร ตังครัตนกุล",
66152: "ภค พรภคกุล",
66176: "รติพรรธน์ อนันต์ธนาดุล",
66182: "ลัธพบ นันทกิจ",
66199: "ศศิปรีญา มาลัยศิริรัตน์",
66203: "ศุภกร กิจธนานันท์",
66205: "ศุภัช ศรีมารดากุล",
66209: "สรัล อุนพานิช",
66211: "สิบเก้าส์ อรรถจินดา",
66230: "อารดา เอกโองการ",

#room3
66001 : "กรวิชญ์ ศรีสง่า",
66009 :"กันตินันท์ เลิศวรรณวิทย์",
66015: "คมณ์เมษช์ มั่งคั่ง",
66032 :"ชัณทัต สุทธินนท์",
66033: "ชัยธัช รัตนนันทเดช",
66037 :"ญาณวัฒน์ กฤษดาธานนท์",
66059: "ณัฐญา เทพิน",
66078 :"ธนัชพร กิตติวงษ์วิวัฒน์",
66233 :"ธนากร แดงนภาพรกุล",
66085 :'ธัญญรัศม์ เรืองธีรสันติ',
66111: 'ปัญญากร สถิรเกียรติ',
66119:'ปานหทัย ภิรมย์สวัสดิ์',
66121: 'ปารดา ยาตะพงศ์',
66127: 'ปุณณภัทร วงศ์วัฒนกิจ',
66136: 'พศวีร์ คงวัน',
66147: 'พิชญาภา วงษ์ท่าเรือ',
66151 :'พีระณัฐ พงศ์พฤติพันธ์',
66154: 'ภชสร อ่ำพายัพ',
66157:' ภวริศา เลิศลุมพลีพันธุ์',
66161 : 'ภัสส์ศา ไพโรจน์กิจจา',
66162 :"ภารวี หนองหารพิทักษ์",
66169 :"ภูริ เสาวรัตน์ชัย",
66178 :'รวิอาภา มนัสวิยางกูร',
66187: 'วรินรำไพ วาพัทธ์ทวีโชติ',
66200: 'ศิกานต์ ดวงเฉลิมวงศ์',
66216: 'สุพิชชา ดวงผุยทอง',
66226: 'อรกัญญา วงศ์ปัญญา',
    #room4
    66023: 'ชนมน บุญรอด',
    66028: 'ชวิชฌ์ บุญหล้า',
    66034 :'ชินทัต สุทธินนท์',
    66036 :'เฌอลิณญ์ วิริยะชัยวรรณ',
    66040 :'ญาธิป วงศ์ณัฐภัทร',
    66043 :'ณกร อัมพรอร่ามเวทย์',
    66048 :'ณพิชญา พรหมเดชไพบูลย์',
    66053 :'ณัชชา ฉุยฉาย',
    66062 :'ณัฐรินีย์ อิงคเลิศสุข',
    66072 :'แทนพงศ์ ธนิตยวงศ์',
    66073 :'ไทธัญ วังปิติ',
    66089 :'ธีทัต วรปาณิ',
    66091 :'ธีรพัฒน์ สีมานนท์',
    66132 :'พรนัชชา จำปาจีน',
    66134 :'พรสุดา วงษ์นุช',
    66140 :'พัทธวรรณ พิบูลธรรม',
    66180 :'รัชญ์สิภา พวงเงิน',
    66185 :'วริทธิ์นันท์ จันทโรทัย',
    66188 :'วสุ กาญจนาทวีลาภ',
    66190 :'วัชรวิชย์ พงษ์ไพรัช',
    66191 :'วาริพิณฑุ์ ลิ้มควรสุวรรณ',
    66193 :'วิภาดา จึงมานะกิจ',
    66201 :'ศิริพงษ์ แซ่ตั้ง',
    66218 :'หฤษฏ ปุณณาภิรมย์',
    66231 :'อิงธรรม ลาภทรัพย์ทวี',

    #room5
    66002: 'กรฬษ วรเชษฐ์',
    66007: 'กันตภณ ประสานสุข',
    66021: 'ฉันชนก ปิยะวิริกุล',
    66026: 'ชยพล แซ่ตั้ง',
    66042: 'ฐิติวรดา กำภู ณ อยุธยา',
    66051: 'ณภัสณดา พิทยศิริ',
    66057: 'ณัฐชา ลิ้มจีระจรัส',
    66067: 'ดังฝัน นนทสูติ',
    66095: 'นรวิชญ์ ลิ้มพรรัตน์',
    66098: 'บรรณสรณ์ ธันญบูรณ์',
    66103: 'ปภังกร ช่อวิเชียร',
    66115: 'ปัณณ์รวี อัครจันทโชติ',
    66122: 'ปาริฉัตร รุ่งแสง',
    66133: 'พรรษชล ธรรมรักษ์',
    66138: 'พัทธดนย์ พิบูลธรรม',
    66156: 'ภรีม ไชยกำเนิด',
    66172: 'เมธาพร ทองเพ็ชร',
    66174: 'เมืองเพชร ทั้งพรม',
    66189: 'วสุ กิจบำรุง',
    66204: 'ศุภกฤต ขำวิวรรธน์',
    66207: 'ศุวสิทธิ์ อุกฤษฏชน',
    66210: 'สาริศา ดวงผุยทอง',
    66217: 'สุรพิชญ์ อรุณสวัสดิ์วงศ์',
    66219: 'อชิรวิชญ์ ปิยะสัจจบูลย์',
    66220: 'อธิชา หล้าเที่ยง',
    66225: 'อภิพัชร อู่ไพบูรณ์',
#room6

    66018: 'จิรัชญา อัศวเลิศวิสุทธิ์',
    66025: 'ชนาภา คงเจริญพร',
    66039: 'ญาดา กิจการเจริญสิน',
    66064: 'ณิชชา นาควิเชตร',
    66070: 'ทิตชญา มั่งคง',
    66074: 'ธนดล เกิดเจริญ',
    66077: 'ธนวัสส์ อาจบำรุง',
    66079: 'ธนากฤต นนทปรัชญากุล',
    66081: 'ธยาน์ ทัฬหกุล',
    66083: 'ธรณ์ธันย์ ตันฮู้',
    66097: 'นิยารินทร์ วงศ์สืบชาติ',
    66101: 'บารเมษฐ์ เจริญชัยสมบัติ',
    66128: 'เป็นขลุ่ย ภมรศักดา',
    66104: 'ปภังกร จตุวรพร',
    66137: 'พศิน ลิมกุล',
    66141: 'พาทิศ เลิศสินธพานนท์',
    66143: 'พิชชากร อรพิมพันธ์',
    66144: 'พิชชานันท์ ตั้งเสงี่ยมวิสัย',
    66168: 'ภูมิพัฒน์ เหล่าบัณฑิต',
    66171: 'ภูริพงษ์ สรรพศรี',
    66175: 'เมืองเอก ทั้งพรม',
    66192: 'วิชศกร วิทูรกิตติกุล',
    66198: 'ศศิณัฎฐ์ ตะวันกาญจนา',
    66214: 'สิรินทร์ จันทรสกุล จ้าว',
    66223: 'อนุรุทธ์ ลี้ไวโรจน์',
    66227: 'อรภิชา ตันจันทร์พงศ์',

    66003: 'กฤตติ์ธามม์ ฐิตเจริญวงศ์',
    66011: 'กิตติพัศ ศรีไพโรจน์',
    66016: 'คีญ รุ่งอมรรัตน์',
    66020: 'เจณณวัฒน์ อุทัยจรัสรัศมี',
    66027: 'ชยุต ตั้งวงษ์ไชย',
    66038: 'ญาณวุฒิ เหล่านภากุล',
    66044: 'ณญากร กำจรกิจการ',
    66049: 'ณพุทธ ตันติพจน์',
    66050: 'ณภัทร พงษ์กิตติพินธ์',
    66054: 'ณัชชา พรหมสาขา ณ สกลนคร',
    66061: 'ณัฐปภัสร์ ฐิติวัชรพงษ์',
    66065: 'ณิชณัชทฐ์ ตัณฑวิเชฐ',
    66076: 'ธนภัทร จินวรรณ',
    66092: 'ธีรวิษณุ์ วงศ์เหมือน',
    66100: 'บวรรัช ต่อสุทธิ์กนก',
    66113: 'ปัญญาภรณ์ กีรติสุทธิสาธร',
    66130: 'พงศภัค เพชรสุก',
    66142: 'พาพัฒน์ วิเศษศักดิ์ดี',
    66145: 'พิชชาภา บุญเก่า',
    66146: 'พิชญภูมิ พรพิพัฒน์กุล',
    66153: 'ภคมน วีระชนานันท์',
    66155: 'ภทรธร สิรินาวงษ์',
    66159: 'ภัทรพร ตันติอนุวัต',
    66173: 'เมืองพลอย ทั้งพรม',
    66212: 'สิรภัทร ประสมแสง',
    66215: 'สิริลภัส ออศิริวิกรณ์',
    66160: "ภัทรภร เสวกวิหารี",
    66186: "วรินทร ถวิลวิทู"







}
room_num = {
    1.1: "กวีวัธน์ ศานติวรพงษ์",
    2.1: "ก้องธฤต เตชัสอนันต์ ",
    3.1 : "เขมจิรา จิราวัฒนอนันต์",
    4.1: "จิรพัทธ์ โลหะวัฒนะกุล",
    5.1 : "ชญาณ์นันท์ รชตะวิวรรธน์",
    6.1 :"ชนัตถ์ ทีรฆวงศ์",
    7.1 : "ชัญญ์วรชา ชาญนำสิน",
    8.1 :'ชัญญา ลิ้มทองกุล',
    9.1 :'ณพล เหมพรรณไพเราะ',
    10.1 :'ณัชชา วาสนาประดิษฐ์',
    11.1 :'ดิน กวินอนันต์',
    12.1 : 'ธารธรรม เรืองวุฒิสกุลชัย',
    13.1 : 'ธีดา ปัทมสันติวงศ์',
    14.1 : 'ปพน ประสมศักดิ์',
    15.1 : 'ปราณรัก บ่ายคล้อย',
    16.1 : 'ปัญญากัญญ์ ไตรทางกูร',
    17.1 : 'ปัณณ์วิชญ์ สุทธิประภา',
    18.1 : 'ปาณิสรา สงวนพงษ์',
    19.1 : 'ปาณิสรา นิ่มมาโนช',
    20.1 : 'พนิตมน เอกโยคะ',
    21.1 : 'พริชฐ์ ธนสารวิมล',
    22.1 : 'พัทธ์ธีรา อรพิมพันธ์',
    23.1 :'ภาริธ น้อยคง',
    24.1 : 'ภีมอินทัช ธีระฐิติ',
    25.1 : 'ภูมิทรรศชล ทองศรี',
    26.1 : 'รรรชนก ศรีโสฬส',
    27.1 : 'ระริน หาญวนานนท์',
    28.1 : 'วชภณ อึ๊งล่ำซำ',
    29.1 : 'วชิรวินทร์ อัศวรุ่งโรจน์',
    30.1 : 'วิภู ธงชัยกุลฤทธิ์',
    31.1 :'ศรัณยพงศ์ ภิยโยภาพ',
    32.1 : 'ศุภิสรา ทองตันหยง',
    33.1: 'สรกฤช ธัญญวรรณ์',

    1.2 :'กันณพงศ์ สมพรเกียรติ',
    2.2 :'กิตติคุณ วงศ์สว่าง',
    3.2 : "เกศมณี ตันทวานิช",
    4.2 : "ชวินธร ชลศักดิ์ตระกูล",
    5.2: "ชุติกาญจน์ ศักดิ์สุวรรณ",
    6.2: "เติมบุญ ประกิตชัยวัฒนา",
    7.2 :"ทัชญา สุวรรณรัตน์",
    8.2: "ทิพย์พิมล ตรีพาสัย",
    9.2: "ธัญ มิ่งแก้ว",
    10.2: "นันท์ณรัตน์ ลีลาวรพันธุ์",
    11.2: "บวรทัต ต่อสุทธิ์กนก",
    12.2: "ปวริศา คงมะลวน",
    13.2: "ปารณีย์ มหาสุวีระชัย",
    14.2: "ปิติภัทรา ศิลโกเศศศักดิ์",
    15.2: "ปุณณพัฒน์ ศิลาทอง",
    16.2: "ผลัฏฐา ธีรฉัตรวัฒน์",
    17.2: "พิภู บูรณศิลป์",
    18.2: "พีร ตังครัตนกุล",
    19.2: "ภค พรภคกุล",
    20.2: "รติพรรธน์ อนันต์ธนาดุล",
    21.2: "ลัธพบ นันทกิจ",
    22.2: "ศศิปรีญา มาลัยศิริรัตน์",
    23.2: "ศุภกร กิจธนานันท์",
    24.2: "ศุภัช ศรีมารดากุล",
    25.2: "สรัล อุนพานิช",
    26.2: "สิบเก้าส์ อรรถจินดา",
    27.2: "อารดา เอกโองการ",

    1.3 : "กรวิชญ์ ศรีสง่า",
    2.3 :"กันตินันท์ เลิศวรรณวิทย์",
    3.3: "คมณ์เมษช์ มั่งคั่ง",
    4.3 :"ชัณทัต สุทธินนท์",
    5.3: "ชัยธัช รัตนนันทเดช",
    6.3 :"ญาณวัฒน์ กฤษดาธานนท์",
    7.3: "ณัฐญา เทพิน",
    8.3 :"ธนัชพร กิตติวงษ์วิวัฒน์",
    9.3 :"ธนากร แดงนภาพรกุล",
    10.3 :'ธัญญรัศม์ เรืองธีรสันติ',
    11.3: 'ปัญญากร สถิรเกียรติ',
    12.3:'ปานหทัย ภิรมย์สวัสดิ์',
    13.3: 'ปารดา ยาตะพงศ์',
    14.3: 'ปุณณภัทร วงศ์วัฒนกิจ',
    15.3: 'พศวีร์ คงวัน',
    16.3: 'พิชญาภา วงษ์ท่าเรือ',
    17.3 :'พีระณัฐ พงศ์พฤติพันธ์',
    18.3: 'ภชสร อ่ำพายัพ',
    19.3:' ภวริศา เลิศลุมพลีพันธุ์',
    20.3 : 'ภัสส์ศา ไพโรจน์กิจจา',
    21.3 :"ภารวี หนองหารพิทักษ์",
    22.3 :"ภูริ เสาวรัตน์ชัย",
    23.3 :'รวิอาภา มนัสวิยางกูร',
    24.3: 'วรินรำไพ วาพัทธ์ทวีโชติ',
    25.3: 'ศิกานต์ ดวงเฉลิมวงศ์',
    26.3: 'สุพิชชา ดวงผุยทอง',
    27.3: 'อรกัญญา วงศ์ปัญญา',

    1.4: 'ชนมน บุญรอด',
    2.4: 'ชวิชฌ์ บุญหล้า',
    3.4 :'ชินทัต สุทธินนท์',
    5.4 :'เฌอลิณญ์ วิริยะชัยวรรณ',
    6.4 :'ญาธิป วงศ์ณัฐภัทร',
    7.4 :'ณกร อัมพรอร่ามเวทย์',
    8.4 :'ณพิชญา พรหมเดชไพบูลย์',
    9.4 :'ณัชชา ฉุยฉาย',
    10.4 :'ณัฐรินีย์ อิงคเลิศสุข',
    11.4 :'แทนพงศ์ ธนิตยวงศ์',
    12.4 :'ไทธัญ วังปิติ',
    13.4 :'ธีทัต วรปาณิ',
    14.4 :'ธีรพัฒน์ สีมานนท์',
    15.4 :'พรนัชชา จำปาจีน',
    16.4 :'พรสุดา วงษ์นุช',
    17.4 :'พัทธวรรณ พิบูลธรรม',
    18.4 :'รัชญ์สิภา พวงเงิน',
    19.4 :'วริทธิ์นันท์ จันทโรทัย',
    20.4 :'วสุ กาญจนาทวีลาภ',
    21.4 :'วัชรวิชย์ พงษ์ไพรัช',
    22.4 :'วาริพิณฑุ์ ลิ้มควรสุวรรณ',
    23.4 :'วิภาดา จึงมานะกิจ',
    24.4 :'ศิริพงษ์ แซ่ตั้ง',
    25.4 :'หฤษฏ ปุณณาภิรมย์',
    26.4 :'อิงธรรม ลาภทรัพย์ทวี',

    1.5: 'กรฬษ วรเชษฐ์',
    2.5: 'กันตภณ ประสานสุข',
    3.5: 'ฉันชนก ปิยะวิริกุล',
    4.5: 'ชยพล แซ่ตั้ง',
    5.5: 'ฐิติวรดา กำภู ณ อยุธยา',
    6.5: 'ณภัสณดา พิทยศิริ',
    7.5: 'ณัฐชา ลิ้มจีระจรัส',
    8.5: 'ดังฝัน นนทสูติ',
    9.5: 'นรวิชญ์ ลิ้มพรรัตน์',
    10.5: 'บรรณสรณ์ ธันญบูรณ์',
    11.5: 'ปภังกร ช่อวิเชียร',
    12.5: 'ปัณณ์รวี อัครจันทโชติ',
    13.5: 'ปาริฉัตร รุ่งแสง',
    14.5: 'พรรษชล ธรรมรักษ์',
    15.5: 'พัทธดนย์ พิบูลธรรม',
    16.5: 'ภรีม ไชยกำเนิด',
    17.5: 'เมธาพร ทองเพ็ชร',
    18.5: 'เมืองเพชร ทั้งพรม',
    19.5: 'วสุ กิจบำรุง',
    20.5: 'ศุภกฤต ขำวิวรรธน์',
    21.5: 'ศุวสิทธิ์ อุกฤษฏชน',
    22.5: 'สาริศา ดวงผุยทอง',
    23.5: 'สุรพิชญ์ อรุณสวัสดิ์วงศ์',
    24.5: 'อชิรวิชญ์ ปิยะสัจจบูลย์',
    25.5: 'อธิชา หล้าเที่ยง',
    26.5: 'อภิพัชร อู่ทอง',

    1.6: 'จิรัชญา อัศวเลิศวิสุทธิ์',
    2.6: 'ชนาภา คงเจริญพร',
    3.6: 'ญาดา กิจการเจริญสิน',
    4.6: 'ณิชชา นาควิเชตร',
    5.6: 'ทิตชญา มั่งคง',
    6.6: 'ธนดล เกิดเจริญ',
    7.6: 'ธนวัสส์ อาจบำรุง',
    8.6: 'ธนากฤต นนทปรัชญากุล',
    9.6: 'ธยาน์ ทัฬหกุล',
    10.6: 'ธรณ์ธันย์ ตันฮู้',
    11.6: 'นิยารินทร์ วงศ์สืบชาติ',
    12.6: 'บารเมษฐ์ เจริญชัยสมบัติ',
    13.6: 'เป็นขลุ่ย ภมรศักดา',
    14.6: 'ปภังกร จตุวรพร',
    15.6: 'พศิน ลิมกุล',
    16.6: 'พาทิศ เลิศสินธพานนท์',
    17.6: 'พิชชากร อรพิมพันธ์',
    18.6: 'พิชชานันท์ ตั้งเสงี่ยมวิสัย',
    19.6: 'ภูมิพัฒน์ เหล่าบัณฑิต',
    20.6: 'ภูริพงษ์ สรรพศรี',
    21.6: 'เมืองเอก ทั้งพรม',
    22.6: 'วิชศกร วิทูรกิตติกุล',
    23.6: 'ศศิณัฎฐ์ ตะวันกาญจนา',
    24.6: 'สิรินทร์ จันทรสกุล จ้าว',
    25.6: 'อนุรุทธ์ ลี้ไวโรจน์',
    26.6: 'อรภิชา ตันจันทร์พงศ์',


    1.7: 'กฤตติ์ธามม์ ฐิตเจริญวงศ์',
    2.7: 'กิตติพัศ ศรีไพโรจน์',
    3.7: 'คีญ รุ่งอมรรัตน์',
    4.7: 'เจณณวัฒน์ อุทัยจรัสรัศมี',
    5.7: 'ชยุต ตั้งวงษ์ไชย',
    6.7: 'ญาณวุฒิ เหล่านภากุล',
    7.7: 'ณญากร กำจรกิจการ',
    8.7: 'ณพุทธ ตันติพจน์',
    9.7: 'ณภัทร พงษ์กิตติพินธ์',
    10.7: 'ณัชชา พรหมสาขา ณ สกลนคร',
    11.7: 'ณัฐปภัสร์ ฐิติวัชรพงษ์',
    12.7: 'ณิชณัชทฐ์ ตัณฑวิเชฐ',
    13.7: 'ธนภัทร จินวรรณ',
    14.7: 'ธีรวิษณุ์ วงศ์เหมือน',
    15.7: 'บวรรัช ต่อสุทธิ์กนก',
    16.7: 'ปัญญาภรณ์ กีรติสุทธิสาธร',
    17.7: 'พงศภัค เพชรสุก',
    18.7: 'พาพัฒน์ วิเศษศักดิ์ดี',
    19.7: 'พิชชาภา บุญเก่า',
    20.7: 'พิชญภูมิ พรพิพัฒน์กุล',
    21.7: 'ภคมน วีระชนานันท์',
    22.7: 'ภทรธร สิรินาวงษ์',
    23.7: 'ภัทรพร ตันติอนุวัต',
    24.7: 'เมืองพลอย ทั้งพรม',
    25.7: 'สิรภัทร ประสมแสง',
    26.7: 'สิริลภัส ออศิริวิกรณ์',







}
switched_dict = {y: x for x, y in room_num.items()}
rvname = {y: x for x, y in names.items()}

def fnumtoname():
    print("System : ระบบค้นหาชื่อจากรหัสประจำตัวนักเรียน")
    while True:
        try:
            readable_num = int(input("System : รหัสประจำตัวนักเรียนคือ \nUser : "))
            if readable_num in names:
                print(names[readable_num])
                break
            else:
                print("System : ไม่พบข้อมูล ขอโทดคับ")

        except ValueError:
            print("System : ใส่รหัสคับ")


#------------------------------------------------------------
def fnametoclass():
    print("System : ระบบค้นหาห้องและเลขที่ จากชื่อ")
    while True:
        try:
            searchnum = str(input("System : ชื่อ \nUser : "))
            if searchnum in switched_dict:
                print("System : " + searchnum + "อยู่ห้อง" + str(switched_dict[searchnum])[:-1]+ "เลขที่ "+str(switched_dict[searchnum])[:-2])
                break
            else:
                print("System : ไม่พบข้อมูล ขอโทดคับ")


        except ValueError:
            print("System : ใส่ชื่อคับ")


#--------------------------------------
def fnametonum():
    print("System : ระบบหารหัสจากชื่อ")

    while True:
        try:
            balls = str(input("System : ใส่ชื่อจริงที่เขียนถูกต้อง ทั้งชื่อและนามสกุล \nUser : "))
            if balls in rvname:
                print(rvname[balls])

                break
            elif balls == "ภัทรภร เวกวิหารี":
                print("System : เราไม่บุลลี่คนงับ ไม่พูดถึง")
            elif balls == "วรินทร ถวิลวิทู":
                print("System : ลาพักอยู่่ ToT ToT")
            else:
                print("System : ไม่เจอชื่องับ")

        except ValueError:
            print("System : ใส่ชื่อคับ")
#--------------------------------------------------
def fclasstoname():
    print("System : ระบบหาชื่อ จากห้องและเลขที่")
    while True:
        try:
            searchnum = float(input("System : " + "เขียนเป็น ห้อง.เลขที่ เช่น ห้อง 1 เลขที่ 5 พิมพ์ว่า 5.1 : \nUser :  "))
            if searchnum in room_num:
                print("System : " + "ห้อง " +str(searchnum)[-1:] + " เลขที่ " + str(searchnum)[:-2] + " คือ "+ room_num[searchnum])
                break

            else:
                print("System : ไม่พบข้อมูล ขอโทดคับ")


        except ValueError:
            print("System : ใส่ชื่อคับ")






while True:
    print("โปรแกรมสามารถทำได้สี่อย่างต้องการได้แก้ \n1.หาชื่อจากรหัส พิมพ์ : numtoname\n2.หารหัสจากชื่อจริง พิมพ์ : nametonum\n3.หาห้องและเลขที่จากชื่อ พิมพ์ : nametoclass\n4.หาชื่อจากห้องและเลขที่ พิมพ์ : classtoname")
    ans = str(input("User : "))
    if ans == "numtoname":
        fnumtoname()

    elif ans == "nametonum":
        fnametonum()

    elif ans == "nametoclass":
        fnametoclass()

    elif ans == "classtoname":
        fclasstoname()

    else:
        print("System : Unknown command")

    answer = input("System : ใช้ต่อไหม? (yes/no)\nUser : ")
    if answer == "no":
        break
        print("Thankyou for using this loser's program")
    else:
        pass
print("#ถ้าชื่อผิดแจ้งได้ที่ ปริ้น")









